In [1]:
import pandas as pd
from sqlalchemy import create_engine, text

In [2]:
# Crear conexión con SQLite

dbname = 'mydatabase.db' # crea base de datos
engine = create_engine('sqlite:///' + dbname)

In [3]:
# Crear dataframe
df = pd.DataFrame({'name':['User 1', 'User 2', 'User 3']})
df

     name
0  User 1
1  User 2
2  User 3

In [5]:
# Crea nueva tabla SQL
df.to_sql('users', con=engine, if_exists='replace')

3

In [6]:
# Usar SQL Queries
query = "SELECT * FROM users"
with engine.connect() as conn:
    result = conn.execute(text(query)).fetchall()
    
print(result)

[(0, 'User 1'), (1, 'User 2'), (2, 'User 3')]

In [7]:
# Leer query con Pandas
pd.read_sql_query(sql=text(query),con=engine.connect())

   index    name
0      0  User 1
1      1  User 2
2      2  User 3

In [8]:
# Conectarse a base de datos SQLite
dbname = 'chinook.db'
engine = create_engine('sqlite:///' + dbname)

In [9]:
# Leer tablas
query = '''
SELECT name FROM sqlite_master WHERE type='table'
'''
pd.read_sql_query(sql=text(query), con=engine.connect())

               name
0            albums
1   sqlite_sequence
2           artists
3         customers
4         employees
5            genres
6          invoices
7     invoice_items
8       media_types
9         playlists
10   playlist_track
11           tracks
12     sqlite_stat1

In [11]:
# Tabla customers
query='''
SELECT * FROM customers
'''
df = pd.read_sql_query(sql=text(query),con=engine.connect())
df.head()

,CustomerId,FirstName,LastName,Company,Address,City,State,Country,PostalCode,Phone,Fax,Email,SupportRepId
0,1,Luís,Gonçalves,Embraer - Empresa Brasileira de Aeronáutica S.A.,"Av. Brigadeiro Faria Lima, 2170",São José dos Campos,SP,Brazil,12227-000,+55 (12) 3923-5555,+55 (12) 3923-5566,luisg@embraer.com.br,3
1,2,Leonie,Köhler,None,Theodor-Heuss-Straße 34,Stuttgart,None,Germany,70174,+49 0711 2842222,None,leonekohler@surfeu.de,5
2,3,François,Tremblay,None,1498 rue Bélanger,Montréal,QC,Canada,H2G 1A7,+1 (514) 721-4711,None,ftremblay@gmail.com,3
3,4,Bjørn,Hansen,None,Ullevålsveien 14,Oslo,None,Norway,0171,+47 22 44 22 22,None,bjorn.hansen@yahoo.no,4
4,5,František,Wichterlová,JetBrains s.r.o.,Klanova 9/506,Prague,None,Czech Republic,14700,+420 2 4172 5555,+420 2 4172 5555,frantisekw@jetbrains.com,4

In [12]:
# Obtener valores únicos
df['Country'].unique()

array(['Brazil', 'Germany', 'Canada', 'Norway', 'Czech Republic',
       'Austria', 'Belgium', 'Denmark', 'USA', 'Portugal', 'France',
       'Finland', 'Hungary', 'Ireland', 'Italy', 'Netherlands', 'Poland',
       'Spain', 'Sweden', 'United Kingdom', 'Australia', 'Argentina',
       'Chile', 'India'], dtype=object)

In [13]:
# Cerrar conexión
engine.dispose()